In [1]:
import pandas as pd

In [3]:
df=pd.DataFrame({'name':['Komal','Surbhi','Anmol','Rohit','Hargun','Jannat'],'class':['btech','Mtech','bca','BBA','Btech','MCA'],'marks':[12,14,15,21,24,16]})
df

     name  class  marks
0   Komal  btech     12
1  Surbhi  Mtech     14
2   Anmol    bca     15
3   Rohit    BBA     21
4  Hargun  Btech     24
5  Jannat    MCA     16

In [6]:
df.loc[:,'rollno']=[1,2,3,4,5,6]

In [7]:
df

     name  class  marks  rollno
0   Komal  btech     12       1
1  Surbhi  Mtech     14       2
2   Anmol    bca     15       3
3   Rohit    BBA     21       4
4  Hargun  Btech     24       5
5  Jannat    MCA     16       6

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   class   6 non-null      object
 2   marks   6 non-null      int64
 3   rollno  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [10]:
df.describe()

           marks    rollno
count   6.000000  6.000000
mean   17.000000  3.500000
std     4.560702  1.870829
min    12.000000  1.000000
25%    14.250000  2.250000
50%    15.500000  3.500000
75%    19.750000  4.750000
max    24.000000  6.000000

In [11]:
df

     name  class  marks  rollno
0   Komal  btech     12       1
1  Surbhi  Mtech     14       2
2   Anmol    bca     15       3
3   Rohit    BBA     21       4
4  Hargun  Btech     24       5
5  Jannat    MCA     16       6

In [12]:
df.insert(loc=2,column='section', value=['A','B','A','C','A','B'])

In [13]:
df

     name  class section  marks  rollno
0   Komal  btech       A     12       1
1  Surbhi  Mtech       B     14       2
2   Anmol    bca       A     15       3
3   Rohit    BBA       C     21       4
4  Hargun  Btech       A     24       5
5  Jannat    MCA       B     16       6

In [15]:
df.section.value_counts()

section
A    3
B    2
C    1
Name: count, dtype: int64

In [16]:
#group by

In [18]:
df[df.loc[:,'section']=='A']

     name  class section  marks  rollno
0   Komal  btech       A     12       1
2   Anmol    bca       A     15       3
4  Hargun  Btech       A     24       5

In [22]:
df.groupby(by='section').get_group('A')

     name  class section  marks  rollno
0   Komal  btech       A     12       1
2   Anmol    bca       A     15       3
4  Hargun  Btech       A     24       5

In [25]:
df.section=df.section.map({'A':1,'B':2,'C':3})

In [26]:
df

     name  class  section  marks  rollno
0   Komal  btech        1     12       1
1  Surbhi  Mtech        2     14       2
2   Anmol    bca        1     15       3
3   Rohit    BBA        3     21       4
4  Hargun  Btech        1     24       5
5  Jannat    MCA        2     16       6

In [28]:
df.rename(columns={'marks':'Numbers'}, inplace=True)

In [29]:
df

     name  class  section  Numbers  rollno
0   Komal  btech        1       12       1
1  Surbhi  Mtech        2       14       2
2   Anmol    bca        1       15       3
3   Rohit    BBA        3       21       4
4  Hargun  Btech        1       24       5
5  Jannat    MCA        2       16       6